<!DOCTYPE html>
<html lang="ko">

<head>
  <meta charset="UTF-8">
  <meta http-equiv="X-UA-Compatible" content="IE=edge">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <title>The Mirae Seoul</title>
  <link rel="stylesheet" href="../css/info.css?after1">
  <link rel="stylesheet" href="../css/header.css">
  <link rel="stylesheet" href="../css/footer.css">
</head>

<body>
  <div class="container">
    <?php
        include_once('./header.php');
        ?>
    <article>
      <section>
        <p id="p1">개인정보처리방침</p>
        <hr id="hr1">
      </section>
      <section id="section0">
        <span>
          <br>
          TheMiraSeoul(이하 ‘회사’라 합니다)는 고객의 개인정보보호를 위하여 최선을 다하고 있으며, 이를 위해 정보통신망이용촉진 및 정보보호 등에 관한 법률(이하 ‘정보통신망법’이라고
          합니다), 개인정보보호법 및 관련법규를 준수하려고 노력하고 있으며, 개인정보처리취급(처리)방침을 회사 홈페이지(http://localhost/TheMiraeSeoul/php/main.php)에
          공개하여 회사의
          개인정보보호와 관련한 일련의 조치들을 고객님께서항상 용이 하게 확인할 수 있게 하였습니다. 회사의 개인정보 취급(처리)방침은 법률의 제·개정, 정부의 정책 변경, 회사의 내부
          방침의 변경에 따라 변경될 수 있으며 변경될 경우 변경내용을 지체 없이 고지하고 고객님께서 이를 쉽게 확인할 수 있도록 조치를 하겠습니다.<br><br>

          회사의 개인정보취급(처리)방침은 다음과 같은 내용을 담고 있습니다.<br><br>

          시행일자 : 2013-10-15<br>
          최종변경일자 : 2020-04-08<br><br>
        </span>
      </section>
      <section id="section01">
        <table id="tb">
          <tr>

            <td><a href="#section1">1. 개인정보의 수집ㆍ목적, 항목 및 수집방법</a></td>
            <td>
            <td><a href="#section10">10. 만14세 미만의 아동에 대한 개인정보보호</a></td>
            </td>
          </tr>
          <tr>
            <td><a href="#section2">2. 수집한 개인정보의 제3자 제공 및 공유</a></td>
            <td>
            <td><a href="#section11">11. 광고성 정보 전송</a></td>
            </td>
          </tr>
          <tr>
            <td><a href="#section3">3. 개인정보취급업무의 위탁</a></td>
            <td>
            <td><a href="#section12">12. 링크사이트</a></td>
            </td>
          </tr>
          <tr>
            <td><a href="#section4">4. 쿠키에 의한 개인정보 수집</a></td>
            <td>
            <td><a href="#section13">13. 게시물</a></td>
            </td>
          </tr>
          <tr>
            <td><a href="#section5">5. 개인정보보유기간 및 파기</a></td>
            <td>
            <td></a></td>
            </td>
          </tr>
          <tr>
            <td><a href="#section6">6. 이용자의 권리ㆍ의무와 그 행사방법</a></td>
            <td></td>
          </tr>
          <tr>
            <td><a href="#section7">7. 개인정보의 안전성 확보 조치</a></td>
            <td></td>
          </tr>
          <td><a href="#section8">8. 의견수렴 및 불만처리</a></td>
          <td></td>
          </tr>
          <td><a href="#section9">9. 개인정보보호책임자</a></td>
          <td></td>
          </tr>

        </table>

      </section>
      <section id="section1">
        <!-- 중간 타이틀 1번 -->
        <p>1. 개인정보의 수집ㆍ목적, 항목 및 수집방법</p>
        <hr>
        <span>가. 회사는 숙박 및 식음료서비스 제공을 위해 회원가입 시 아래의 개인정보를 필수적으로 수집합니다.</span>
        <table>
          <td>항목</td>
          <td>목적</td>
          <td>기간</td>
          <tr>
            <td>
              성명, 아이디, 비밀번호, 생년월일, e-mail 주소, 연락처, 주소, 결제 및 투숙정보
            </td>
            <td>
              본인확인 및 멤버쉽 회원 서비스 제공,호텔상품 계약 및 배송
            </td>
            <td>
              회원탈회 또는 배송완료시까지 투숙 후 5년
            </td>
          </tr>
        </table>
        <span>나. 회사는 회원가입 시 아래의 개인정보를 선택적으로 수집합니다.</span>
        <table>
          <td>항목</td>
          <td>목적</td>
          <td>기간</td>
          <tr>
            <td>
              성명, e-mail, 연락처, 기념일
            </td>
            <td>
              기념일에 따른 혜택제공, 상품 및 서비스 소개, 고객만족도 조사
            </td>
            <td>
              회원탈회시 또는 투숙 후 5년
            </td>
          </tr>
        </table>
        <span>다.회사는 온라인 회원의 경우 서비스 이용과정 중에 IP정보, 쿠키정보, 서비스 이용기록, 결제정보(신용카드번호, 계좌번호, 상품권 번호, 통신사 결제승인번호 등)등을 온라인
          회원 서비스를 제공 및 금융거래 확인을 하기 위한 목적으로만 수집할 수 있습니다.
          <br><br>
          라.회사는 홈페이지 회원가입, 서면, 팩스, 전화, 상담게시판, 이벤트 응모 및 생성정보의 수집방법을 통하여 개인정보를 수집합니다.</span>
      </section>
      <section id="section2">
        <!-- 중간 타이틀 2번 -->
        <p>2. 수집한 개인정보의 제3자 제공 및 공유</p>
        <hr>
        <span>가.회사는 고객의 동의가 있거나 관련 법령의 규정에 의한 경우를 제외하고는 어떠한 경우에도 "개인정보의 수집목적 및 이용목적"에서 고지한 범위를 넘어 고객의 개인정보를
          이용하거나 외부에 제공하지 않습니다.
          <br><br>
          나.당사가 제공하는 서비스를 통하여 거래관계가 이루어진 경우, 거래이행을 위해 관련 정보는 필요한 범위 내에서 회원이 동의한 경우 아래와 같이 거래 당사자에게 제공합니다.
          <br>(서부산지점 제외)</span>
        <table>
          <tr>
            <td>제공받는자</td>
            <td>제공받는자의 개인정보 이용 목적 </td>
            <td>제공하는 개인정보 항목</td>
            <td>개인정보 보유 및 이용 기간</td>
          </tr>
          <tr>
            <td>TheMiraeSeoul</td>
            <td>통합예약서비스 및 관련 편의 제공</td>
            <td>성명, 생년월일, E-mail, 전화번호, 투숙기간 (도착일시, 출발일시), 결제수단정보, 여권번호, 고객 기호</td>
            <td>투숙 후 5년</td>
          </tr>
        </table>
        <span>다.매각, 인수합병 등 서비스 제공자의 권리와 의무가 완전 승계, 이전되는 경우 반드시 사전에 정당한 사유와 절차에 대해 상세하게 고지할 것이며 고객의 개인정보에 대한 동의
          철회의 선택권을 부여합니다.
          <br><br>
          라.고객의 동의를 구하고 개인정보를 제공하거나 공유할 경우에는 사전에 고객께 제공처가 누구인지, 제공 또는 공유되는 개인정보항목이 무엇인지, 왜 그러한 개인정보가 제공되거나
          공유되어야 하는지, 그리고 언제까지 어떻게 보호ㆍ관리되는지에 대해 개별적으로 서면 또는 전자우편 등을 통해 고지하여 동의를 구하는 절차를 거치게 되며, 제공처의 변경이 있을 경우
          같은 절차에 의하여 고지하거나 동의를 구합니다.
          <br><br>
          마.다음의 경우에는 관련 법령의 규정에 의해 고객의 동의 없이 개인정보를 제공하는 것이 가능합니다.

          - 서비스 제공에 관한 계약 이행

          - 관련 법령의 규정에 의하거나, 수사 목적으로 법령에 정해진 절차와 방법에 따라 수사기관의 요구가 있는 경우

          - 통계작성, 학술연구나 시장조사를 위해 특정 개인을 식별할 수 없는 형태로 가공하여 제공하는 경우</span>
      </section>
      <section id="section3">
        <!-- 중간 타이틀 3번 -->
        <p>3. 개인정보취급업무의 위탁</p>
        <hr>
        <span>회사는 서비스 이행을 위해 다음과 같이 개인정보 취급 업무를 외부 전문업체에 위탁하여 운영하고 있습니다.</span>
        <table>
          <td>위탁을 받는 자(수탁자)</td>
          <td>위탁을 하는 업무</td>
          <tr>
            <td>
              미래SDS
            </td>
            <td>
              홈페이지 유지 및 관리, 전산시스템 운용
            </td>
          </tr>
          <tr>
            <td>미래전자</td>
            <td>영상정보처리기기(CCTV) 운영</td>
          </tr>
          <tr>
            <td>미래물산</td>
            <td>다이닝 예약 시스템 운용</td>
          </tr>
          <tr>
            <td>(주)미래기술</td>
            <td>SMS, MMS 전송 업무</td>
          </tr>
          <tr>
            <td>TheMiraeSeoul</td>
            <td>카카오 알림톡 발송 대행</td>
          </tr>
        </table>
      </section>
      <section id="section4">
        <!-- 중간 타이틀 4번 -->
        <p>4. 쿠키에 의한 개인정보 수집</p>
        <hr>
        <span>가.쿠키(cookie) 운용

          회사는 이용자의 편의를 위하여 쿠키를 운영합니다. 회사가 쿠키를 통해 수집하는 정보는 회원 아이디, 접속 IP등입니다. 회사가 쿠키(cookie)를 통해 수집한 정보는 로그인 상태
          유지, 맞춤화된 개별 광고서비스 등에 이용합니다.
          <br><br>
          나.쿠키의 설치/ 운영 및 거부

          고객은 쿠키 설치에 대한 선택권을 가지고 있으며, 웹브라우져에서 옵션을 설정하여 모든 쿠키를 허용하거나, 쿠키가 저장될 때마다 확인을 거치게 하거나 아니면 쿠키의 저장을 거부할 수
          있습니다. 단, 쿠키저장을 거부하였을 경우 로그인이 필요한 서비스에 일부 제한이 있을 수 있습니다.</span>
      </section>
      <section id="section5">
        <!-- 중간 타이틀 5번 -->
        <p>5. 개인정보보유기간 및 파기</p>
        <hr>
        <span>가. 회사는 개인정보의 수집목적 또는 제공받은 목적이 달성시까지 보유하며, 목적달성 또는 동의받은 기간이 종료하면 개인정보를 지체 없이 파기합니다. 구체적인 파기시점은 아래와
          같습니다.

          - 회원가입 정보 : 회원가입을 탈퇴하거나 회원에서 제명된 때

          - 배송 정보 : 물품 또는 서비스가 인도되거나 제공된 때

          - 설문조사, 이벤트 등의 목적을 위하여 수집한 경우: 당해 설문조사, 이벤트 등을 종료한 때

          - 본인확인정보: 본인임을 확인 한 때

          - 위 개인정보 수집목적 달성 시 즉시파기 원칙에도 불구하고, 관련법령및 내부 규정에 의하여 거래 관련 분쟁처리 등을 이유로 일정기간 보유하여야 할 필요가 있을 경우에는 다음과
          같이 일정기간 보유합니다.

          - 계약 또는 청약철회 등에 관한 기록 : 5년

          - 대금결제 및 재화 등의 공급에 관한 기록 : 5년

          - 소비자의 불만 또는 분쟁처리에 관한 기록 : 3년
          <br><br>
          나. 파기방법

          - 종이에 출력된 개인정보: 분쇄기를 통한 분쇄 또는 파쇄전문업체 위탁

          - 전자적 파일형태로 저장된 개인정보: 기록을 재생할 수 없는 기술적 방법을 사용하여 삭제</span>
      </section>
      <section id="section6">
        <!-- 중간 타이틀 6번 -->
        <p>6. 이용자의 권리·의무와 그 행사방법</p>
        <hr>
        <span>가. 고객은 언제든지 등록되어 있는 고객의 개인정보를 열람하거나 정정·삭제, 처리정지, 동의철회를 요청하실 수 있습니다. 개인정보 열람, 정정·삭제, 처리정지, 동의철회를
          하고자 할 경우에는 『회원정보』를 클릭하여 직접 열람 또는 정정하거나 대표전화(02-2222-1111) 또는 개인정보보호책임자에게 서면, 전화 또는 이메일로 연락하시면 본인 확인
          절차를 거쳐 지체 없이 조치하겠습니다.
          <br><br>
          나.고객이 개인정보의 오류에 대한 정정을 요청하신 경우에는 정정을 완료하기 전까지 당해 개인정보를 이용 또는 제공하지 않습니다. 또한 잘못된 개인정보를 제3자에게 이미 제공한
          경우에는 정정 처리결과를 제3자에게 지체 없이 통지하여 정정이 이루어지도록 조치하겠습니다.</span>
      </section>
      <section id="section7">
        <!-- 중간 타이틀 7번 -->
        <p>7. 개인정보의 안전성 확보 조치</p>
        <hr>
        <span>회사는고객의 개인정보를 취급함에 있어 개인정보가 분실, 도난, 누출, 변조 또는 훼손되지 않도록 안전성 확보를 위해 다음과 같은 기술적, 관리적, 물리적 대책을 강구하고
          있습니다.

          - 개인정보 취급 직원의 최소화 및 교육
          개인정보취급자의 지정을 최소화하고 정기적인 교육을 시행합니다.

          - 정기적인 자체 감사 실시
          개인정보 취급 관련 안정성 확보를 위해 정기적으로 자체 감사를 실시합니다.

          - 내부관리계획의 수립 및 시행
          개인정보의 안전한 처리를 위하여 내부관리계획을 수립하고 시행합니다.

          - 개인정보의 암호화
          이용자의 개인정보는 비밀번호는 암호화 되어 저장 및 관리되고 있어, 본인만이 알 수 있으며 파일 및 전 송 데이터를 암호화 및 중요한 데이터는 별도의 보안 기능을 통해 보호되고
          있습니다. 해킹 등에 대비한 기술적 대책 해킹이나 컴퓨터 바이러스 등에 의한 개인정보 유출 및 훼손을 막기 위하여 보안프로그램을 설치하고 주기적인 갱신ㆍ점검을 하며 외부로부터
          접근이 통제된 구역에 시스템을 설치하고 기술적/물리적으로 감시 및 차단합니다.

          - 개인정보에 대한 접근 제한
          개인정보를 처리하는 데이터베이스시스템에 대한 접근권한의 부여,변경,말소를 통하여 개인정보에 대한 접근통제를 위하여 필요한 조치를 하고 있으며 침입차단시스템을 이용하여 외부로부터의
          무단 접근을 통제합니다.

          - 접속기록의 보관 및 위변조 방지
          개인정보처리시스템에 접속한 기록을 최소 6개월 이상 보관, 관리하고 있으며, 접속 기록이 위변조 및 도난, 분실되지 않도록 보안기능 사용하고 있습니다.

          - 문서보안을 위한 잠금장치 사용
          개인정보가 포함된 서류, 보조저장매체 등을 잠금장치가 있는 안전한 장소에 보관하고 있습니다. 비인가자에 대한 출입 통제 개인정보를 보관하고 있는 물리적 보관 장소를 별도로 두고
          이에 대해 출입통제 절차를 수립, 운영하고 있습니다.</span>
      </section>
      <section id="section8">
        <!-- 중간 타이틀 8번 -->
        <p>8. 의견수렴 및 불만처리</p>
        <hr>
        <span>가.회사는 고객님의 의견을 소중하게 생각하며, 고객님은 의문사항으로부터 언제나 성실한 답변을 받을 권리가 있습니다. 당사는 고객님과의 원활한 의사소통을 위해 고객상담 전화를
          설치해놓고 있습니다.

          【고객상담 처리센터】전화번호 :02-111-1111
          <br><br>
          나.전화상담은 오전 9시 ~ 오후 6시까지 가능합니다. 전자우편이나 팩스 및 우편을 이용한 상담은 접수 후 24시간 내에 성실하게 답변 드리겠습니다. 다만, 근무시간 이후 또는
          주말 및 공휴일에는 익일 처리하는 것을 원칙으로 합니다.
          <br><br>
          다.기타 개인정보침해에 대한 신고나 상담이 필요하신 경우에는 아래 기관에 문의하시기 바랍니다.
          <br><br>
          - 개인정보침해신고센터(<a href="http://privacy.kisa.or.kr">privacy.kisa.or.kr</a> / 국번없이 118)
          <br><br>
          - 대검찰청 첨단범죄수사과(<a href="http://spo.go.kr">www.spo.go.kr</a> / 국번없이 1301)
          <br><br>
          - 경찰청 사이버안전국(<a href="http://cyberbureau.police.go.kr">cyberbureau.police.go.kr</a> / 국번없이
          182)</span>
      </section>
      <section id="section9">
        <!-- 중간 타이틀 9번 -->
        <p>9. 개인정보보호책임자</p>
        <hr>
        <span>회사는 고객의 개인정보를 보호하고 개인정보에 대한 의견수렴 및 불만처리를 담당하기 위하여 아래와 같이 관련부서 및 개인정보보호책임자를 지정하고 있습니다.</span>
        <table>
          <td>구분</td>
          <td>개인정보보호책임자</td>
          <td>개인정보보호관리자</td>
          <tr>
            <td>
              성명
            </td>
            <td>
              신동민
            </td>
            <td>
              이재익
            </td>
          </tr>
          <tr>
            <td>
              소속
            </td>
            <td>
              개발팀
            </td>
            <td>
              개발팀
            </td>
          </tr>
          <tr>
            <td>
              직책
            </td>
            <td>
              팀장
            </td>
            <td>
              부팀장
            </td>
          </tr>
          <tr>
            <td>
              전화
            </td>
            <td>
              010-5671-1126
            </td>
            <td>
              010-9871-8804
            </td>
          </tr>
          <tr>
            <td>
              E-mail
            </td>
            <td>
              sdm1126@naver.com
            </td>
            <td>
              lji8804@naver.com
            </td>
          </tr>
        </table>
      </section>
      <section id="section10">
        <!-- 중간 타이틀 10번 -->
        <p>10. 만14세 미만의 아동에 대한 개인정보보호</p>
        <hr>
        <span>회사는 청소년보호법을 준수하고자 만14세 미만의 아동에 대해서는 개인정보를 수집하지 않고 있으며, 기타 호텔사업과 관련한 14세미만의 미성년자에 대해 정보를 수집하고자 할 경우
          법정대리인의 동의를 받고 있습니다.</span>
      </section>
      <section id="section11">
        <!-- 중간 타이틀 11번 -->
        <p>11. 광고성 정보 전송</p>
        <hr>
        <span>가.회사는 고객의 명시적인 수신거부의사에 반하여 영리목적의 광고성 정보를 전송하지 않습니다.
          <br><br>
          나.회사는 제품정보 안내 등 온라인 마케팅을 위해 광고성 정보를 이메일 등으로 전송하는 경우 이메일 제목란 및 본문란에 다음 사항과 같이 고객께서 쉽게 알아 볼 수 있도록
          조치합니다.

          - 이메일 제목란 : (광고)라는 문구를 제목란에 표시하지 않을 수 있으며 이메일본문란의 주요 내용을 표시합니다.

          - 이메일 본문란 : 이용자가 수신거부의 의사표시를 할 수 있는 전송자의 명칭, 이메일 주소, 전화번호 및 주소를 명시합니다. 이용자가 수신거부의 의사를 쉽게 표시할 수 있는
          방법을 각각 명시합니다.
          <br><br>
          다.광고수신에 동의한 고객에게 팩스ㆍ휴대폰 문자전송 등 전자우편 이외의 방법을 통해 영리목적의 광고성 정보를 전송하는 경우에도 전송자의 명칭을 표기하는 등 필요한 조치를
          취합니다.</span>
      </section>
      <section id="section12">
        <!-- 중간 타이틀 12번 -->
        <p>12. 링크사이트</p>
        <hr>
        <span>가.회사는 고객께 다른 회사의 웹사이트 또는 자료에 대한 링크를 제공할 수 있습니다. 이 경우 신라스테이는 외부사이트 및 자료에 대한 아무런 통제권이 없으므로 그로부터 제공받는
          서비스나 자료의 유용성에 대해 책임질 수 없으며 보증할 수 없습니다.
          <br><br>
          나.회사가 포함하고 있는 링크를 클릭(click)하여 타 사이트(site)의 페이지로 옮겨갈 경우 해당 사이트의 개인정보처리방침은 신라스테이와 무관하므로 새로 방문한 사이트의
          정책을 검토해 보시기 바랍니다.</span>
      </section>
      <section id="section13">
        <!-- 중간 타이틀 13번 -->
        <p>13. 게시물</p>
        <hr>
        <span>가.회사는 고객의 게시물을 소중하게 생각하며 변조, 훼손, 삭제되지 않도록 최선을 다하여 보호합니다. 그러나 다음의 경우는 그렇지 아니합니다.

          - 스팸(spam)성 게시물 (예 : 행운의 편지, 특정사이트 광고 등)

          - 타인의 비방목적으로 허위 사실을 유포하여 타인의 명예를 훼손하는 글

          - 동의 없는 타인의 신상공개, 제 3자의 저작권 등 권리를 침해하는 내용, 기타 게시판 주제와 다른 내용의 게시물

          - 회사는 바람직한 게시판 문화를 활성화하기 위하여 동의 없는 타인의 신상 공개시 특정 부분을 삭제하거나 기호 등으로 수정하여 게시할 수 있습니다.

          - 다른 주제의 게시판으로 이동 가능한 내용일 경우 해당 게시물에 이동 경로를 밝혀 오해가 없도록 하고 있습니다.

          - 그 외의 경우 명시적 또는 개별적인 경고 후 삭제 조치할 수 있습니다.
          <br><br>
          나.근본적으로 게시물에 관련된 제반 권리와 책임은 작성자 개인에게 있습니다. 또 게시물을 통해 자발적으로 공개된 정보는 보호받기 어려우므로 정보 공개 전에 심사 숙고하시기
          바랍니다.</span>
      </section>
    </article>
    <?php
        include_once('./footer.php');
        ?>

  </div>

</body>

</html>